Repository: arrebagrove/MatrixJar
Catalog: MatrixCalc/lang/*/Resources.resw
Source language: en
Languages: ru

# Clear.Label
source: Clear matrix
ru: Очистить матрицу

# Copy.Label
source: Copy matrix
ru: Скопировать матрицу

# CopyFail
source: Can't copy matrix!
ru: Не удалось скопировать матрицу!

# CopyFirst
source: Copy matrix first!
ru: Сначала скопируйте матрицу!

# CopySuccess
source: Matrix was copied!
ru: Матрица скопирована!

# Det.Text
source: DETERMINANT
ru: ОПРЕДЕЛИТЕЛЬ

# DetNotExists
source: Row count is not equal to column count, determinant does not exist!
ru: Количество строк не равно количеству столбцов, определитель не существует!

# ErrorInput.Text
source: Input error
ru: Ошибка ввода

# ErrorInputHelper.Text
source: It seems that one of matrices is not filled or is filled in an incorrect way!
ru: Похоже, что одна из матриц не заполнена или заполнена некорректно!

# ErrorOperation.Text
source: Operating error
ru: Ошибка выполнения

# FillMatrix
source: Please, fill matrix {0}!
ru: Заполните матрицу {0}!

# Inverse.Text
source: INVERSED MATRIX
ru: ОБРАТНАЯ МАТРИЦА

# MatrixA.Header
source: Matrix A
ru: Матрица А

# MatrixB.Header
source: Matrix B
ru: Матрица B

# MenuDet.Text
source: Determinant
ru: Определитель

# MenuInverse.Text
source: Inversed matrix
ru: Обратная матрица

# MenuMinus.Text
source: Subtraction
ru: Вычитание

# MenuMulti.Text
source: Multiplication
ru: Умножение

# MenuPlus.Text
source: Addition
ru: Сложение

# MenuTranspose.Text
source: Transposition
ru: Транспонирование

# Minus.Text
source: SUBTRACTION
ru: ВЫЧИТАНИЕ

# Multi.Text
source: MULTIPLICATION
ru: УМНОЖЕНИЕ

# MultiErr
source: Column count in matrix A is not equal to row count in matrix B. Can't find multiplication of A and B!
ru: Количество столбцов матрицы А не равно количеству строк матрицы В. Операция умножения возможна только в том случае, если это условие выполнено!

# Paste.Label
source: Paste matrix
ru: Загрузить матрицу

# Plus.Text
source: ADDITION
ru: СЛОЖЕНИЕ

# PlusMinusErr
source: Matrix A size differs from matrix B size! A and B sizes must be equal.
ru: Размеры матриц не совпадают! Операции сложения и вычитания можно совершать только над матрицами одинаковой размерности.

# ResDet.Title
source: Determinant △ A
ru: Определитель △ A

# ResInverse.Title
source: Inversed matrix А
ru: Обратная матрица А

# ResMinus.Title
source: Matrices subtraction А - В
ru: Разность матриц А - В

# ResMulti.Title
source: Matrices multiplication А х В
ru: Произведение матриц А х В

# ResPlus.Title
source: Matrices sum А + В
ru: Сумма матриц А + В

# ResTranspose.Title
source: Transposed matrix А
ru: Транспонированная матрица А

# Result.Header
source: Result
ru: Результат

# Transpose.Text
source: TRANSPOSITION
ru: ТРАНСПОНИРОВАНИЕ
